app/controllers/users_controller.rb

    def create

        if user_params[:password] == user_params[:password_confirmation]
            @user = User.new(user_params)

            if @user.save
---
INSERT INTO "users" ("name", "age", "email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)